Documents/БП_УстановкаРейтингаНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>БП_УстановкаРейтингаНоменклатуры</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.БП_РейтингНоменклатуры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦеныРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>99</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Рейтинг</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/БП_РейтингНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>БП_РейтингНоменклатуры</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Рейтинг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипЦеныРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/БП_УстановкаРейтингаНоменклатуры/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// регістр БП_РейтингНоменклатуры	
	НаборЗаписей = РегистрыСведений.БП_РейтингНоменклатуры.СоздатьНаборЗаписей();	
	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);  
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();	
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = НаборЗаписей.Добавить();
		Движение.Период = Дата;
		Движение.ТипЦеныРасчета = ТипЦеныРасчета;
//		Движение.Поставщик = ТекСтрокаТовары.Поставщик;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Рейтинг = ТекСтрокаТовары.Рейтинг;
		Движение.Активность = Истина;
	КонецЦикла;
	НаборЗаписей.Записать(Истина);
	
	
	Если Не Отказ И ТипЦеныРасчета = Справочники.ТипыЦенНоменклатуры.НайтиПоНаименованию("ionity.tires",,,) тогда  
		Попытка
			МассивПараметров = Новый Массив;
			МассивПараметров.Добавить(Дата);
            МассивПараметров.Добавить(ТипЦеныРасчета);
			МассивПараметров.Добавить(Ссылка); 
			
			ФоновыеЗадания.Выполнить("БП_ОбменMagentoВФоне.БП_ВыполнитьОтправкуНаСайтРейтинга", МассивПараметров,,"ОтправкаРейтингаНоменклатурыНаСайт");
			Сообщить("Вивантаження номенклатури на сайт почалось. Ви можете продовжувати користуватись програмою, невдовзі оновлені дані з'являться на сайті.");
		Исключение
			Сообщить("Не вдалося запустити вивантаження на сайт. Зверніться до адміністратора!");
		КонецПопытки; 
	КонецЕсли;

КонецПроцедуры
